{
    "id": "25",
    "title": "Financial Planning: Key Concepts and Practical Applications",
    "type": "Finance",
    "img": "25.jpg",
    "section": "Stock markets are divided into specialized segments to cater to companies at different stages of growth, from large, mature enterprises to emerging tech startups. Three key segments—main board, growth enterprise market (GEM), and sci-tech innovation board—each have unique listing rules, target companies, and risk profiles. This article breaks down their features, helping investors and businesses understand which segment fits their needs.",
    "content": [
        "<img src=\"25_content.jpg\">",
        "<h4>What Are Stock Market Segments?</h4>",
        "<p>Stock exchanges use segments to classify companies based on size, profitability, industry, and growth potential. This categorization helps investors make informed decisions (e.g., balancing risk and return) and ensures companies are matched with appropriate investors. The main segments—main board, GEM, and sci-tech innovation board—serve distinct purposes but share the core goal of facilitating capital raising.</p>",
        "<h4>1. Main Board: For Established, Large-Cap Companies</h4>",
        "<p>The main board is the primary segment of a stock exchange, designed for well-established companies with stable earnings and large market capitalization. It is the most traditional and strictly regulated segment.</p>",
        "<h5>Key Features</h5>",
        "<p>•Listing Criteria:</p>",
        "<p>◦High profitability requirements (e.g., minimum cumulative net profit of $15–30 million over 3 years).</p>",
        "<p>◦Large market capitalization (often $100 million+ at listing).</p>",
        "<p>◦Proven track record (typically 3+ years of operation).</p>",
        "<p>◦Strong corporate governance and financial transparency.</p>",
        "<p>•Target Companies:</p>",
        "<p>◦Mature industries: Banking, energy, manufacturing, consumer goods (e.g., multinational corporations, national giants).</p>",
        "<p>◦Companies with stable cash flows and low volatility in earnings.</p>",
        "<p>•Trading Characteristics:</p>",
        "<p>◦Lower price volatility compared to other segments.</p>",
        "<p>◦Attracts institutional investors (pension funds, mutual funds) seeking stable returns.</p>",
        "<p>◦Dividend payouts are common, reflecting consistent profitability.</p>",
        "<h5>Examples of Main Board Companies</h5>",
        "<p>•Large financial institutions, automotive manufacturers, and retail chains with decades of operation and significant market share.</p>",
        "<h4>2. Growth Enterprise Market (GEM): For Emerging, High-Growth Companies</h4>",
        "<p>GEM (or \"second board\") targets smaller, younger companies with high growth potential but less established track records. It balances stricter regulation than unregulated markets with more flexibility than the main board.</p>",
        "<h5>Key Features</h5>",
        "<p>•Listing Criteria:</p>",
        "<p>◦Lower profitability thresholds (e.g., net profit of $2–5 million over 2 years, or revenue growth above 30% with some profitability).</p>",
        "<p>◦Smaller market capitalization ($50–100 million at listing).</p>",
        "<p>◦Focus on growth potential over long-term stability.</p>",
        "<p>•Target Companies:</p>",
        "<p>◦Emerging industries: Software, healthcare, renewable energy, and consumer tech.</p>",
        "<p>◦Companies in expansion phases, reinvesting profits into R&D or market expansion.</p>",
        "<p>•Trading Characteristics:</p>",
        "<p>◦Higher volatility due to reliance on future growth expectations (rather than current earnings).</p>",
        "<p>◦Attracts retail investors and venture capitalists seeking high returns.</p>",
        "<p>◦Higher risk of price swings, especially if growth targets are missed.</p>",
        "<h5>Examples of GEM Companies</h5>",
        "<p>•Mid-sized tech firms, biotech startups with promising clinical trials, or innovative consumer brands gaining market share.</p>",
        "<h4>3. Sci-Tech Innovation Board: For Cutting-Edge Tech and R&D-Driven Firms</h4>",
        "<p>The sci-tech innovation board (sometimes called \"tech board\") is a specialized segment for companies focused on breakthrough technologies, even if they are not yet profitable. It prioritizes innovation over short-term financial performance.</p>",
        "<h5>Key Features</h5>",
        "<p>•Listing Criteria:</p>",
        "<p>◦Relaxed or no profitability requirements (e.g.,允许pre-revenue companies with high R&D spending).</p>",
        "<p>◦Strict focus on \"hard tech\": Artificial intelligence, biotech, quantum computing, advanced manufacturing, or new energy.</p>",
        "<p>◦Proof of technological innovation (e.g., patents, proprietary technology, or industry recognition).</p>",
        "<p>◦Minimum market capitalization varies but often starts at $50 million, with higher thresholds for unprofitable firms.</p>",
        "<p>•Target Companies:</p>",
        "<p>◦Early-stage tech innovators: AI developers, gene therapy firms, or companies building next-gen semiconductors.</p>",
        "<p>◦Firms with high R&D costs and long product development cycles (e.g., drug discovery companies).</p>",
        "<p>•Trading Characteristics:</p>",
        "<p>◦Highest volatility among the three segments, driven by technological breakthroughs or setbacks.</p>",
        "<p>◦Allows \"price discovery\" with wider daily trading limits (e.g., ±20% vs. ±10% on main board).</p>",
        "<p>◦Attracts investors comfortable with high risk in exchange for potential disruptive growth.</p>",
        "<h5>Examples of Sci-Tech Board Companies</h5>",
        "<p>•Startups developing autonomous driving systems, CRISPR-based therapies, or renewable energy storage technologies.</p>",
        "<h4>Key Differences Between the Segments</h4>",
        "<p>Aspect</p>",
        "<p>Main Board</p>",
        "<p>GEM</p>",
        "<p>Sci-Tech Innovation Board</p>",
        "<p>Profitability Requirement</p>",
        "<p>Strict (3+ years of profits)</p>",
        "<p>Lax (2 years, or revenue growth focus)</p>",
        "<p>Often none (focus on tech potential)</p>",
        "<p>Market Cap</p>",
        "<p>Large ($100M+)</p>",
        "<p>Medium ($50–100M)</p>",
        "<p>Variable ($50M+, higher for unprofitable)</p>",
        "<p>Risk Level</p>",
        "<p>Low</p>",
        "<p>Medium</p>",
        "<p>High</p>",
        "<p>Investor Base</p>",
        "<p>Institutional investors, risk-averse</p>",
        "<p>Retail investors, growth-focused</p>",
        "<p>Venture capital, tech-savvy investors</p>",
        "<p>Industry Focus</p>",
        "<p>Traditional, mature industries</p>",
        "<p>Emerging growth industries</p>",
        "<p>Cutting-edge tech and R&D</p>",
        "<h4>FAQs About Stock Market Segments</h4>",
        "<p>•Q: Can a company switch segments?</p>",
        "<p>A: Yes. A GEM-listed company with growing profits may move to the main board, while a main board firm diversifying into tech might list a subsidiary on the sci-tech board.</p>",
        "<p>•Q: Why do unprofitable companies list on the sci-tech board?</p>",
        "<p>A: To raise capital for R&D or scaling, even if they haven’t turned a profit. Investors bet on future revenue from breakthrough technologies (e.g., a biotech firm awaiting FDA approval for a new drug).</p>",
        "<p>•Q: Are sci-tech board stocks riskier for investors?</p>",
        "<p>A: Yes—many rely on unproven technologies, and failure to commercialize products can lead to sharp price drops. However, successful innovators offer outsized returns.</p>",
        "<p>•Q: How do listing costs compare?</p>",
        "<p>A: Main board listings are most expensive (legal, auditing, and underwriting fees), followed by GEM. Sci-tech boards may offer subsidies to attract tech firms, offsetting some costs.</p>",
        "<p>•Q: What role do these segments play in the economy?</p>",
        "<p>A: Main boards support stable employment and dividend income. GEM fuels mid-sized business growth. Sci-tech boards drive innovation, critical for long-term economic competitiveness.</p>",
        "<h4>Choosing the Right Segment: For Companies and Investors</h4>",
        "<p>•For companies: Match your stage to the segment—mature firms with profits choose the main board; high-growth startups opt for GEM; tech innovators pursue the sci-tech board.</p>",
        "<p>•For investors: Balance risk and goals—main board for stability, GEM for growth, and sci-tech for high-risk, high-reward opportunities (with thorough research).</p>",
        "<p>Stock market segments ensure that companies of all sizes and stages can access capital, while helping investors navigate risk. Whether you’re a large corporation seeking to expand or an investor chasing tech breakthroughs, understanding these segments is key to making informed decisions in the dynamic world of equities.</p>"
    ],
    "create_time": 1754278066
}