{
  "id": "117",
  "title": "TCR - T Therapy Progress: Transforming the Landscape of Cancer Treatment",
  "type": "medicalCare",
  "img": "public/images/117.png",
  "section": "T - cell receptor (TCR) therapy is an innovative form of immunotherapy that aims to enhance the body's natural immune response against diseases, particularly cancer. The human immune system has T cells that play a crucial role in recognizing and eliminating foreign invaders and abnormal cells. However, cancer cells often develop mechanisms to evade this immune surveillance. TCR - T therapy steps in by genetically engineering a patient's own T cells to recognize and target specific antigens presented on cancer cells.",
  "content": [
    "<p style=\"line-height: 2;\"><img src=\"public/images/117_content_0.png\" alt=\"\"></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">The TCR is a protein complex found on the surface of T cells. In normal circumstances, it binds to small fragments of proteins (peptides) presented by major histocompatibility complex (MHC) molecules on the surface of cells. This binding is highly specific, allowing T cells to distinguish between healthy and diseased cells. In TCR - T therapy, scientists isolate T cells from a patient's blood. These T cells are then genetically modified to express a new TCR that has a high affinity for an antigen associated with the patient's cancer. Once modified, the T cells are expanded in the laboratory to create a large population and then re - infused into the patient, where they can seek out and destroy cancer cells.</span></p>\n<h4 style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><strong>Recent Progress in TCR - T Therapy</strong></span></h4>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">1. </span><!--[endif]--><strong>FDA Submission for Afami - cel</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">In 2024, a significant milestone was reached when Adaptimmune, a biopharmaceutical company, submitted a marketing authorization application for Afami - cel to the U.S. Food and Drug Administration (FDA). Afami - cel is a TCR - T therapy designed to treat advanced synovial sarcoma, a type of soft - tissue tumor. If approved, it would be the first - in - class TCR - T therapy for solid tumors. In the United States, around 13,000 people are newly diagnosed with soft - tissue tumors annually, and synovial sarcoma accounts for 5 - 10% of these cases, with a dismal five - year survival rate of only 20%. The potential approval of Afami - cel could revolutionize the treatment landscape for these patients.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">2. </span><!--[endif]--><strong>Treatment of Pancreatic Cancer</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">A remarkable case study published in the New England Journal of Medicine in 2022 demonstrated the potential of TCR - T therapy in treating pancreatic cancer. A 72 - year - old woman with metastatic pancreatic cancer (KRAS G12D mutation) received a single injection of 16.2 billion engineered T cells. Just one month after the treatment, the tumor metastases began to regress. After six months, the tumor had shrunk by 72%. This was a significant breakthrough considering the poor prognosis typically associated with metastatic pancreatic cancer. The patient had previously failed other treatments, including a tumor - infiltrating lymphocyte (TIL) therapy. This case not only highlights the effectiveness of TCR - T therapy in a hard - to - treat cancer but also shows that it can provide a viable treatment option even after other immunotherapies have failed.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">3. </span><!--[endif]--><strong>Advances in Targeting Low - Abundance Neoantigens</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">A study published in Cell Reports in 2024 by a team at Tsinghua University explored the use of a synthetic T - cell receptor and antigen receptor (STAR). The research aimed to address the challenge of targeting low - abundance neoantigens in solid tumors. Neoantigens are unique to cancer cells due to mutations and are ideal targets for immunotherapy. However, their low abundance on the surface of tumor cells has made them difficult to target effectively. The STAR receptor was found to be able to replicate the antigen sensitivity of the natural TCR. In comparison, chimeric antigen receptor (CAR) - T cells, another form of immunotherapy, were found to be 10 - 100 times less sensitive to the same antigens in the context of low - abundance neoantigens. STAR - T cells showed enhanced killing effects in tumors with low - density neoantigens both in vitro and in mouse models, indicating great potential for treating malignant solid tumors.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">4. </span><!--[endif]--><strong>Targeting KRAS Mutations</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">KRAS mutations are common in many types of cancer, such as pancreatic, colorectal, and lung cancers, and have long been considered \"undruggable\" due to the lack of suitable drug - binding sites. In a study published in Nature Communications, researchers from the Chinese Academy of Sciences identified specific TCRs that target the KRAS - G12V mutation. The engineered TCR - T cells, such as the 1 - 2C TCR - T cells, showed significant tumor - suppressing activity in mouse models of pancreatic cancer (PANC - 1) and colorectal cancer (SW620). Moreover, when combined with a PD - 1 antibody, they demonstrated a synergistic effect, further enhancing tumor suppression. This research not only provides a new treatment option for cancers with KRAS - G12V mutations but also offers insights into potential combination therapies.</span></p>\n<h4 style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><strong>Comparison with Other Immunotherapies: TCR - T vs. CAR - T</strong></span></h4>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">1. </span><!--[endif]--><strong>Antigen Recognition</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">CAR - T cells are engineered to express a chimeric antigen receptor that can directly recognize antigens on the surface of cancer cells. In contrast, TCR - T cells rely on their TCRs to recognize antigens presented by MHC molecules, which can be from both cell - surface and intracellular proteins. This allows TCR - T cells to target a broader range of antigens. For example, in solid tumors, CAR - T cells often have difficulty penetrating the tumor mass and tend to attach mainly to the outer layer of the tumor. TCR - T cells, on the other hand, can more evenly distribute within the tumor due to their ability to recognize a wider variety of antigens presented by MHC molecules on tumor cells throughout the tumor tissue.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">2. </span><!--[endif]--><strong>Sensitivity and Specificity</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">As mentioned earlier, in the context of targeting low - abundance neoantigens, TCR - T cells (especially those with receptors like STAR) have been shown to be more sensitive than CAR - T cells. CAR - T cells typically have a higher affinity for their target antigens but lower sensitivity in detecting low - levels of antigens. TCR - T cells, with their natural - like antigen - recognition mechanism, can detect and respond to antigens at lower concentrations. However, one challenge with TCR - T cells is ensuring high specificity to avoid cross - reactivity with normal tissues, as the TCR - MHC - antigen interaction is a complex process. In contrast, CAR - T cells, with their more straightforward antigen - binding design, can be engineered with high specificity for the target antigen, but this can sometimes lead to on - target, off - tumor toxicity if the antigen is also present on normal tissues.</span></p>\n<h4 style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><strong>Challenges and Limitations of TCR - T Therapy</strong></span></h4>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">1. </span><!--[endif]--><strong>Manufacturing Complexity</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">The process of manufacturing TCR - T cells is highly complex and requires specialized laboratory facilities and expertise. First, isolating T cells from a patient's blood and then genetically modifying them to express the desired TCR is a multi - step process. Ensuring the quality and functionality of the engineered T cells during the expansion phase in the laboratory is crucial. Any contamination or improper cell growth can affect the efficacy and safety of the final product.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">2. </span><!--[endif]--><strong>Potential for Toxicity</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">Similar to other immunotherapies, TCR - T therapy can cause significant toxicity. One of the main concerns is cytokine release syndrome (CRS), which occurs when the activated T cells release large amounts of cytokines into the bloodstream, leading to symptoms such as fever, chills, fatigue, and in severe cases, organ failure. Another potential toxicity is on - target, off - tumor effects, where the TCR - T cells may recognize and attack normal tissues that express the target antigen at low levels, leading to damage to healthy organs.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">3. </span><!--[endif]--><strong>Limited Response in Some Patients</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">Not all patients respond to TCR - T therapy. Factors such as the patient's overall health, the nature of the tumor (e.g., tumor heterogeneity, the presence of immunosuppressive factors in the tumor microenvironment), and the specific antigen being targeted can influence the response rate. For example, in some tumors, the MHC molecules may not effectively present the target antigen, or the tumor may produce factors that inhibit the activation and function of TCR - T cells.</span></p>\n<h4 style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><strong>Future Prospects of TCR - T Therapy</strong></span></h4>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">1. </span><!--[endif]--><strong>Expansion of Targetable Cancers</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">As research progresses, the number of cancer types that can be effectively treated with TCR - T therapy is expected to increase. Currently, while there are promising results in treating synovial sarcoma, pancreatic cancer, and cancers with specific KRAS mutations, efforts are underway to target other types of solid tumors, such as non - small - cell lung cancer, melanoma, and head - and - neck cancer. Additionally, TCR - T therapy may also be explored for the treatment of certain viral - associated diseases, as T cells can be engineered to target antigens associated with viruses like human papillomavirus (HPV) or Epstein - Barr virus (EBV) that are linked to cancer development.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">2. </span><!--[endif]--><strong>Combination Therapies</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">Combining TCR - T therapy with other treatment modalities is likely to be a key area of development. For example, as seen in the case of KRAS - G12V - targeted TCR - T cells combined with PD - 1 antibodies, combination therapies can potentially enhance the efficacy of treatment. TCR - T cells can be combined with other immunotherapies such as immune checkpoint inhibitors, cancer vaccines, or with traditional therapies like chemotherapy or radiotherapy. The idea is that different treatments can act synergistically to overcome the various mechanisms by which cancer cells evade the immune system and resist treatment.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">3. </span><!--[endif]--><strong>Improving Manufacturing and Delivery</strong></span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">Ongoing research aims to simplify and standardize the manufacturing process of TCR - T cells, reducing costs and ensuring a more consistent product quality. Additionally, developing better methods for delivering TCR - T cells to the tumor site is crucial. This may involve improving the homing ability of the engineered T cells to the tumor, enhancing their survival and persistence in the body, and optimizing the timing and dosage of T - cell infusions to maximize therapeutic effects while minimizing toxicity.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">In conclusion, TCR - T therapy has shown great promise in recent years, with significant progress in treating various cancers, especially solid tumors. While there are still challenges to overcome, the continuous research and development in this field offer hope for improved cancer treatment outcomes in the future.</span></p>"
  ],
  "create_time": 1753674504
}