{
  "id": "18",
  "title": "All About Medications : From Prescription to Over-the-Counter Options",
  "type": "Emergency & Safety",
  "img": "18.jpg",
  "section": "What Are Medications?\nMedications (or drugs) are substances designed to prevent, treat, or manage diseases, alleviate symptoms, or improve bodily functions. They can be derived from natural sources (e.g., plants, minerals) or synthesized chemically in laboratories. Medications work by interacting with the body’s biological systems—for example, by blocking pain signals, fighting infections, or regulating hormone levels. They come in various forms, including pills, capsules, liquids, injections, creams, and inhalers, and are classified based on their purpose, ingredients, and how they are regulated.",
  "content": [
    "<p style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><img src=\"18_content_0.jpg\" alt=\"\" width=\"1536\" height=\"864\"></span></p>\n<h3 style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><strong>Common Types of Medications</strong></span></h3>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Prescription Medications</strong>: These require a healthcare provider&rsquo;s authorization (a prescription) due to their potential risks or need for precise dosing. Examples include antibiotics for severe infections, opioids for chronic pain, and medications for chronic conditions like diabetes or hypertension. They are often stronger or have more significant side effects, requiring professional oversight.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Over-the-Counter (OTC) Medications</strong>: Available without a prescription, these treat mild, common conditions such as headaches, colds, or minor pain. Examples include pain relievers (e.g., acetaminophen, ibuprofen), antihistamines for allergies, and cough suppressants. They are considered safe for general use when following label instructions.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Generic vs. Brand-Name Medications</strong>: Generic drugs contain the same active ingredients as brand-name versions but are typically cheaper. They meet the same quality and effectiveness standards as brand-name drugs, as regulated by health authorities.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Specialty Medications</strong>: These are complex drugs used to treat serious or rare conditions, such as cancer, rheumatoid arthritis, or multiple sclerosis. They may be biologic (made from living organisms) and often require special storage, administration (e.g., injections), or monitoring.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Herbal and Dietary Supplements</strong>: While not always classified as medications, these products (e.g., vitamins, herbal extracts) are used to support health. They are regulated differently than pharmaceuticals and may interact with other drugs, so consulting a healthcare provider is advisable.</span></p>\n<h3 style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><strong>How Medications Work</strong></span></h3>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">Medications interact with the body&rsquo;s cells, tissues, or organs to produce a therapeutic effect:</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Targeting Specific Receptors</strong>: Many drugs bind to proteins (receptors) on cell surfaces, triggering or blocking biological responses. For example, beta-blockers attach to heart receptors to lower blood pressure.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Altering Enzyme Activity</strong>: Some medications inhibit or enhance enzymes (proteins that speed up chemical reactions) to regulate bodily processes. Statins, for instance, block an enzyme involved in cholesterol production.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Fighting Pathogens</strong>: Antibiotics kill or inhibit bacteria, while antiviral drugs interfere with virus replication, helping the immune system fight infections.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Replacing Deficiencies</strong>: Hormone replacement therapies (e.g., insulin for diabetes, thyroid medication) <span style=\"font-family: 等线;\">补充 </span><span style=\"font-family: Arial;\">the body&rsquo;s insufficient production of essential substances.</span></span></p>\n<h3 style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><strong>Safe Medication Use Practices</strong></span></h3>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Follow Prescriptions Exactly</strong>: Take the prescribed dose at the correct time, and complete the full course (e.g., antibiotics) even if symptoms improve. Do not skip doses or adjust amounts without consulting a healthcare provider.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Read Labels Carefully</strong>: For OTC drugs, check active ingredients, dosage instructions, and warnings (e.g., &ldquo;do not take with alcohol&rdquo;). Note expiration dates, as expired medications may lose effectiveness or become harmful.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Track All Medications</strong>: Keep a list of current prescriptions, OTC drugs, and supplements, including dosages and frequencies. Share this list with healthcare providers to avoid harmful interactions.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Store Properly</strong>: Keep medications in a cool, dry place (avoid bathrooms, where humidity can degrade them). Store opioids and other controlled substances securely to prevent misuse. Keep medications out of reach of children and pets.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Dispose of Unused Medications Safely</strong>: Do not flush drugs down the toilet unless instructed. Use designated take-back programs at pharmacies or community centers, or follow label guidelines for household disposal (e.g., mixing with coffee grounds to deter ingestion).</span></p>\n<h3 style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><strong>Common Risks and How to Avoid Them</strong></span></h3>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Side Effects</strong>: Many medications cause mild side effects (e.g., drowsiness, nausea), but some can be severe (e.g., allergic reactions, organ damage). Report unusual symptoms to a healthcare provider immediately.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Drug Interactions</strong>: Combining medications (prescription, OTC, or supplements) can alter effectiveness or increase risks. For example, mixing blood thinners with certain pain relievers may increase bleeding risk.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Overdose</strong>: Taking more than the recommended dose can lead to toxicity. This is particularly dangerous with opioids, acetaminophen, and heart medications.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Drug Resistance</strong>: Overuse or misuse of antibiotics can lead to bacterial resistance, making infections harder to treat. Always take antibiotics as prescribed.</span></p>\n<h3 style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><strong>Frequently Asked Questions (FAQs)</strong></span></h3>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>What should I do if I miss a dose?</strong> For most medications, take the missed dose as soon as you remember, unless it is almost time for the next dose (then skip it). Do not double up on doses. Consult a healthcare provider for specific guidance, especially for drugs like birth control or insulin.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Can I take expired medications?</strong> Expired drugs may not work as intended and could be harmful. It is best to discard them safely.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Why do generic drugs cost less than brand-name ones?</strong> Generic manufacturers do not incur the costs of developing and marketing a new drug, allowing them to price lower. They are required to prove bioequivalence to the brand-name version.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>How can I reduce the risk of drug interactions?</strong> Inform all healthcare providers of every substance you take, including supplements and herbal products. Use one pharmacy for all prescriptions to enable pharmacists to check for interactions.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>Are herbal supplements safe to take with prescription drugs?</strong> Not always. For example, St. John&rsquo;s wort can reduce the effectiveness of antidepressants and birth control. Always consult a healthcare provider before combining them.</span></p>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><!-- [if !supportLists]--><span style=\"mso-list: Ignore;\">&bull; </span><!--[endif]--><strong>What should I do if I experience a severe side effect?</strong> Seek emergency medical help immediately. For less severe issues, contact your healthcare provider or pharmacist to discuss whether to continue the medication.</span></p>\n<h3 style=\"line-height: 2;\"><span style=\"font-size: 12pt;\"><strong>Conclusion</strong></span></h3>\n<p class=\"15\" style=\"line-height: 2;\"><span style=\"font-size: 12pt;\">Medications play a vital role in maintaining health and treating illness, but their safe and effective use requires knowledge and responsibility. Understanding the types of medications, how they work, and following proper usage guidelines can help maximize benefits while minimizing risks. Always communicate openly with healthcare providers and pharmacists, track your medications, and prioritize safe storage and disposal. By taking an informed approach, you can ensure that medications support your health effectively.</span></p>\n<p style=\"line-height: 2;\"> </p>"
  ],
  "create_time": 1755142924
}