{
    "id": "159",
    "title": "Is Mercedes-AMG's Switch from V8 to Four-Cylinder Justified?",
    "img": "159.jpg",
    "content": [
        "<p><img src=\"159_content_1.jpg\"></p>\n<p dir=\"auto\">The rumors were accurate&mdash;the iconic V8 has been swapped out for a four-cylinder powerhouse that drives all AMG compact cars. This new engine features electric turbocharging, boasting an impressive output of 350kW and 545Nm&mdash;quite a feat from a mere 2.0-liter four-pot.</p>\n<p dir=\"auto\">Alas, our fears regarding the engine note have materialized. While modern engineering compensates for displacement through power multiplication, the distinct charm of the V8 remains irreplaceable. The sonorous decline traces back to the era of the 6.2 naturally aspirated mill a decade ago.</p>\n<p dir=\"auto\">Embracing the hybrid wave brings forth even greater power and torque&mdash;500kW and 1020Nm, to be exact&mdash;compared to the previous 375kW and 700Nm. The weight of the C 63 has surged, demanding a strategic approach. To achieve these formidable numbers, a rear-mounted electric motor joins forces with the handcrafted four-pot upfront, augmenting the driving experience dynamically.</p>\n<p dir=\"auto\"><strong>Significant Evolutions in Performance</strong></p>\n<p dir=\"auto\">Among the notable changes, the C 63 now integrates fully variable AWD akin to its competitors, bidding farewell to its distinctive rear-drive tradition. However, distinguishing itself from other models, this Mercedes permits the detachment of front-wheel drive for those seeking to drift, albeit under carefully controlled circumstances.</p>\n<p dir=\"auto\">This iteration excels in peak power and torque, propelling faster in the linear dash with a substantial improvement in sprint performance. The acceleration clocks in at an impressive 3.4 seconds, marking a substantial enhancement in thrust.</p>\n<p dir=\"auto\">The fusion of electric components with robust combustion engines has set a new standard in the realm of high-performance vehicles, with notable acceleration figures now more prevalent. Electric and hybrid hypercars elevate the accelerative benchmarks to new heights.</p>\n<p dir=\"auto\"><strong>Innovations and Electrification</strong></p>\n<p dir=\"auto\">The fifth-generation W206 C 63 boasts additional upgrades, including rear-wheel steering for enhanced mechanical grip, agility, and stability in tight corners. The introduction of a plug for electric charging transforms the driving experience, offering a brief stint of electric-only propulsion, powered by a 6.3kWh battery pack.</p>\n<p dir=\"auto\">Despite these advancements, the C 63 retains its intrinsic AMG DNA, striking a balance between dynamism and refinement. The integration of cutting-edge technology and electrification underscores the brand's commitment to innovation and performance.</p>\n<p dir=\"auto\">As Mercedes reevaluates its hybrid strategy, the impending evolution in the CLE 63 hints at a potential return to a 4.0 twin-turbo V8 with mild hybrid technology&mdash;a move that could further distinguish it from competitors in the premium segment. The refined characteristics of the latest C 63 underscore a shift towards a harmonious blend of power and sophistication.</p>\n<p dir=\"auto\">These transformative changes set the stage for an exciting era in AMG's performance lineup, offering enthusiasts a glimpse of what the future holds. The journey towards electrification and hybridization marks a pivotal moment in the brand's illustrious history, promising a fusion of innovation, performance, and driving pleasure for discerning consumers.</p>\n<table>\n<tbody>\n<tr>\n<td><strong>Model</strong></td>\n<td>Mercedes-AMG C 63 S E Performance</td>\n</tr>\n<tr>\n<td><strong>Price</strong></td>\n<td>$199,900</td>\n</tr>\n<tr>\n<td><strong>Engine</strong></td>\n<td>1991cc, IL4, T, DI</td>\n</tr>\n<tr>\n<td><strong>Power</strong></td>\n<td>350kW @ 6750rpm</td>\n</tr>\n<tr>\n<td><strong>Torque</strong></td>\n<td>545Nm @ 5000-5250rpm</td>\n</tr>\n<tr>\n<td><strong>Motor Output</strong></td>\n<td>150kW / 320Nm</td>\n</tr>\n<tr>\n<td><strong>Drivetrain</strong></td>\n<td>8-speed auto, AWD</td>\n</tr>\n<tr>\n<td><strong>Combined Output</strong></td>\n<td>500kW / 1020Nm</td>\n</tr>\n<tr>\n<td><strong>Fuel Use</strong></td>\n<td>6.1L/100km</td>\n</tr>\n<tr>\n<td><strong>C02 Output</strong></td>\n<td>223g/km</td>\n</tr>\n<tr>\n<td><strong>0-100km/h</strong></td>\n<td>3.14 sec</td>\n</tr>\n<tr>\n<td><strong>Tyre Size</strong></td>\n<td>f-265/35/R20 r-275/35/R20</td>\n</tr>\n<tr>\n<td><strong>Fuel Capacity</strong></td>\n<td>60L</td>\n</tr>\n<tr>\n<td><strong>Stability systems</strong></td>\n<td>ABS, ESP, TV</td>\n</tr>\n<tr>\n<td><strong>Safety</strong></td>\n<td>AEB, ACC, BSM, LDW, RCTA, ALK, AHB</td>\n</tr>\n<tr>\n<td><strong>Luggage Capacity</strong></td>\n<td>279L</td>\n</tr>\n<tr>\n<td><strong>Tow rating</strong></td>\n<td>Not rated to tow</td>\n</tr>\n<tr>\n<td><strong>Service intervals</strong></td>\n<td>12 months/25,000km</td>\n</tr>\n<tr>\n<td><strong>Warranty</strong></td>\n<td>3 years/unlimited km</td>\n</tr>\n<tr>\n<td><strong>ANCAP rating</strong></td>\n<td>5 Stars (2022)</td>\n</tr>\n<tr>\n<td><strong>Weight</strong></td>\n<td>2144kg (claimed)</td>\n</tr>\n</tbody>\n</table>"
    ],
    "type": "Car",
    "create_time": 1719476555,
    "section": "For enthusiasts of the C 63, a pivotal change has arrived, signaling the end of an era while heralding a new one. In our last assessment of a 2019 C 63 wagon, we hinted at a looming shift: \"Enjoy the V8 while you can, for the next iteration won't evoke the same thunderous allure.\""
}